�������4�M
��$�%	�&�'
��(
��)�*
�+�,	�&�-�.
�/�0�1�2�3�4�5�6�7�8�9�:�;�<�=�>�<init>�()V�Code�LineNumberTable�main�([Ljava/lang/String;)V�
StackMapTable�?�%�
SourceFile�
solution.java���java/util/Scanner�@�A�B��C�D�E�SUN�?�F�G�H�I�7�J�K�L�MON�6�TUE�5�WED�4�THU�3�FRI�2�SAT�1�solution�java/lang/Object�java/lang/String�java/lang/System�in�Ljava/io/InputStream;�(Ljava/io/InputStream;)V�nextLine�()Ljava/lang/String;�equals�(Ljava/lang/Object;)Z�out�Ljava/io/PrintStream;�java/io/PrintStream�println�(Ljava/lang/String;)V�!��������������������*���������������	����������������Y����M,��L+������	��
+��������
+
��������
+��������
+��������
+��������
+��������
��������F����������
�!��*��2��;��C��L��T��]��e��n��v� ��"���&�������!� �!��"����#