�������4�7��contest_156/Beginner��java/lang/Object�scn�Ljava/util/Scanner;�<clinit>�()V�Code��java/util/Scanner	�
���java/lang/System���in�Ljava/io/InputStream;
�
����<init>�(Ljava/io/InputStream;)V	�����LineNumberTable�LocalVariableTable
�����this�Lcontest_156/Beginner;�main�([Ljava/lang/String;)V
�
�!�"�#�nextInt�()I	�
�%�&�'�out�Ljava/io/PrintStream;
�)�+�*�java/io/PrintStream�,�-�println�(I)V�args�[Ljava/lang/String;�n�I�DR�CR�
StackMapTable�
SourceFile�
Beginner.java�!����������������	���.��������
Y�����������������������������	���/�����*���������������������������	����	���������-���� <���� =>���>��
d
dh`>��$��(��������&�	���	��
������
�����%��,�����*����-�.�/����&�0�1����2�1����3�1��4���	���	��5����6