�������7�1
�	��	��
��
�� 	��!
�"�#�$�%�<init>�()V�Code�LineNumberTable�LocalVariableTable�this�Lt1;�main�([Ljava/lang/String;)V�args�[Ljava/lang/String;�scanner�Ljava/util/Scanner;�x�I�
SourceFile�t1.java�
��java/util/Scanner�&�'�(�
�)�*�+�,�-�.�/�0�t1�java/lang/Object�java/lang/System�in�Ljava/io/InputStream;�(Ljava/io/InputStream;)V�nextInt�()I�out�Ljava/io/PrintStream;�java/io/PrintStream�println�(I)V�!��	�������
������/�����*�������
��������������������	�������j����� ��Y����L+��=����pd�������
�������	��
����
���� ���� ��������������������