import java.util.*;
public class Main{
    static Scanner kbd = new Scanner(System.in);
    public static void main(String[] args){
	while(kbd.hasNext()){
	    int n = kbd.nextInt();  // nテ、ツコツコテ」ツ?ョテ・ツァツ氾・ツ督。テ」ツ?古」ツ??」ツ?ヲテ」ツ??
	    int q = kbd.nextInt();  // qテ、ツコツコテ」ツ?古ゥツ?偲・ツ債甘ヲツ閉ー
	    if(n!=0 && q!=0){
		int[] date = new int[100];
		//テ、ツシツ堙ィツュツーテ」ツ?ョテ・ツ?凖ィツ」ツ愿ヲツ猟・テ」ツ?ッ1テヲツ猟・テ・ツセツ古、ツサツ・テ、ツクツ?00テヲツ猟・テ・ツセツ古ヲツ慊ェテヲツコツ?

		while(n!=0){
		    //テ・ツァツ氾・ツ督。テ、ツクツ?、ツコツコテ、ツクツ?、ツコツコテ」ツ?ォテ」ツ?、テ」ツ??」ツ?ヲテ」ツ??
		    int s = kbd.nextInt(); // sテヲツ猟・テ・ツ按?」ツ?ョテ、ツコツ暗・ツョツ堙」ツ?古ァツゥツコテ」ツ??」ツ?ヲテ」ツ??」ツ?ヲテ」ツ??
		    while(s!=0){
			int a = kbd.nextInt(); // テ・ツ?キテ、ツスツ禿ァツ堋?」ツ?ォテ」ツ?ッaテヲツ猟・テ」ツ?古・ツ渉ッ
			date[a]++;
			s--;
		    }
		    n--;
		}

		int ans = 0;
		for(int i=0; i<date.length; i++){
		    //テ」ツ?敕」ツ?ョテヲツ猟・テ」ツ?ォテゥツ崢?」ツ?セテ」ツつ古」ツつ凝、ツコツコテヲツ閉ーテ」ツ?古ゥツ?偲・ツ債甘ヲツ閉ーqテ」ツつ津ィツカツ?」ツ?暗」ツ?ヲテ」ツ??」ツ?ヲテ」ツ??」ツ?凝」ツ?、テヲツ慊?」ツつづ・ツ、ツ堙」ツ??ヲツ猟・テ」ツつ津ヲツ篠「テ」ツ??
		    if(date[i]>=q && date[ans]<date[i])
			ans = i;  //テァツュツ氾」ツ?暗」ツ?ィテ」ツ?療」ツ?ヲテ・ツ?コテ・ツ環崚」ツ?凖」ツつ凝」ツ?ョテ」ツ?ッテ、ツコツコテヲツ閉ー
		}
		//テゥツ?偲・ツ債甘ヲツ閉ーテ」ツつ津ィツカツ?」ツ?暗」ツ?ヲテ」ツ??」ツ?ェテ」ツ??ゥツ卍静」ツつ甘」ツ?‖nsテ」ツ?ッ0テ」ツ?ョテ」ツ?セテ」ツ?セ
		System.out.println(ans);
	    }
	}
    }
}